comp-sci/theorem-provers/mizar/rings.org
#+TITLE: Ring Theory - A Rosetta Stone
#+AUTHOR: Alex Nelson
#+EMAIL: pqnelson@gmail.com
#+DATE: <2025-12-28T13:22:34-08:00>
#+LANGUAGE: en
#+OPTIONS: H:nil toc:nil num:nil
#+HTML_DOCTYPE: html5
#+INCLUDE: ../../../org-macros.org
#+HTML_LINK_UP: ./index.html
#+HTML_LINK_HOME: ../../../index.html
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="../../../css/stylesheet.css" />
# Created Sunday December 28, 2025 at  1:22PM

* Ch. 7 Introduction to Rings
:PROPERTIES:
:CUSTOM_ID: h-8f9a8455-0e59-42cc-b7dd-aee5d81f3542
:END:

Following the enumeration of results found in Dummit and Foote's
/Abstract Algebra/, chapters 7 through 9, we relate the results of
ring theory in Mizar.

