comp-sci/theorem-provers/mizar/rings.org
** \sect7.1 Basic Definitions and Examples
:PROPERTIES:
:CUSTOM_ID: h-78a9fb8d-458e-4180-974f-4c0119f156dc
:END:

- *Definition.* A {{{dfn(Ring)}}} $R$ is a non-empty set with two binary $+$ and
  $\times$ (called addition and multiplication) such that ([[https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#NM3][~vectsp_1~]])
  - addition is commutative: for all $x,y\in R$, we have $x+y=y+x$ ([[https://mizar.uwb.edu.pl/version/current/html/rlvect_1.html#V2][~Abelian~]])
  - associativity of addition $(x+y)+z=x+(y+z)$ for all $x,y,z\in R$
    ([[https://mizar.uwb.edu.pl/version/current/html/rlvect_1.html#V3][~add-associative~]])
  - additive inverse: for each $x\in R$, there exists a $y\in R$ such
    that $x+y=0$ (i.e., every element is [[https://mizar.uwb.edu.pl/version/current/html/algstr_0.html#V10][~right_complementable~]])
  - additive identity $x+0=x$ ([[https://mizar.uwb.edu.pl/version/current/html/rlvect_1.html#V4][~right_zeroed~]]) and by commutativity $0+x=x$ for all $x\in R$
  - multiplication is [[https://mizar.uwb.edu.pl/version/current/html/group_1.html#V3][associative]]: for all $x,y,z\in R$ we have $(xy)z=x(yz)$
  - it is [[https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#V4][well-unital]]: for all $x\in R$, we have $x\cdot 1=x$ and
    $1\cdot x=x$
  - multiplication is [[https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#V5][distributive]] over addition: for all $x,y,z\in R$
    we have $x(y+z)=xy+xz$ and $(x+y)z=xz+yz$
- *Remark.* This is technically a little "overfitted": Mathematicians
  can work with nonassociative rings, and do so all the time.
- *Definition.* A ring $R$ is {{{dfn(Commutative)}}} if multiplication
  is [[https://mizar.uwb.edu.pl/version/current/html/group_1.html#V5][commutative]].
- *Definition.* A ring $R$ is said to have an {{{dfn(Identity)}}}
  (i.e., is {{{dfn(Unital)}}}) if there is an element $1\in R$ such
  that for all $a\in R$ we have $1\times a=a\times 1=a$.
  - *Remark.* Sadly, Mizar's ring is defined to /always/ be
    unital. Therefore we will tend to drop the "unital" prefix.
- *Implicit Definition.* A ring $R$ is called {{{dfn(Degenerate)}}} if
  $1=0$. Otherwise, $R$ is said to be {{{dfn(Non-degenerate)}}}.
- *Definition.* A nondegenerate ring $R$ is called a {{{dfn(Division Ring)}}}
  (or a {{{dfn(Skew-Field)}}}) if every nonzero $a\in R$ has a
  multiplicative inverse ([[https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#NM4][~vectsp_1~]]).
- *Definition.* A {{{dfn(Field)}}} is a commutative Skew-Field ([[https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#NM5][~vectsp_1~]]).
- *Examples.*
  1. The integers form a ring, which Mizar calls [[https://mizar.uwb.edu.pl/version/current/html/int_3.html#K1][~INT.Ring~]]
  2. The real numbers form a field which Mizar calls [[https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#K2][~F_Real~]]
  3. The rational numbers form a field which Mizar calls [[https://mizar.uwb.edu.pl/version/current/html/gaussint.html#K11][~F_Rat~]]
  4. The complex numbers form a field which Mizar calls [[https://mizar.uwb.edu.pl/version/current/html/complfld.html#K1][~F_Complex~]]
  5. The integers modulo $n$ forms a commutative ring which Mizar
     calls [[https://mizar.uwb.edu.pl/version/current/html/int_3.html#K9][~INT.Ring n~]]
  6. The quaternions form a ring $\mathbb{H}$ which Mizar calls [[https://mizar.uwb.edu.pl/version/current/html/quatern2.html#K15][~R_Quaternion~]]
  7. If $A$ is a ring and $X$ is a nonempty set, then the set $R$ of
     all functions $X\to A$ forms a ring {{{missing()}}}
- *Proposition 1.* Let $R$ be a ring. Then
  1. For all $a\in R$ we have $0a=a0=0$ ([[https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#T7][~vectsp_1:7~]] and [[https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#T14][~vectsp_1:14~]])
  2. For all $a,b\in R$ we have
     - ([[https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#T8][~vectsp_1:8~]]) $a(-b)=-(ab)$
     - ([[https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#T9][~vectsp_1:9~]]) $(-a)b=-(ab)$
  3. For all $a,b\in R$ we have $(-a)(-b)=ab$ ([[https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#T10][~vectsp_1:10~]])
  4. For all $a\in R$ we have $-a=(-1)a$ ([[https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#T14][~vectsp_1:14~]])
- *Definition.* Let $R$ be a ring.
  1. We say $x\in R$ is a {{{dfn(Zero Divisor)}}} if there is a $y\in R$
     such that $y\neq0$ and $xy=0$. Mizar requires $R$ to be
     commutative. ([[https://mizar.uwb.edu.pl/version/current/html/ringfrac.html#NM1][~ringfrac~]])
  2. If $R$ is nondegenerate (i.e., $1\neq0$), we say $x\in R$ is
     {{{dfn(Unital)}}} if there exists some $y\in R$ such that $xy=1$
     and $yx=1$ ([[https://mizar.uwb.edu.pl/version/current/html/gcd_1.html#V1][~gcd_1:def 2~]])
- *Examples.*
  - The example $\mathbb{Q}(\sqrt{D})$ where $D^{2}\notin\mathbb{Q}$
    is a specialized example of adjoining the squareroot of a
    nonsquare element of a field. In Mizar, this is done by
    ~FieldAdjunction(F,{sqrt a})~ (see, e.g., Lemma [[https://mizar.uwb.edu.pl/version/current/html/field_9.html#E84][~dega~]] in
    ~field_9~)
- *Definition.* A commutative nondegenerate ring is called an
  {{{dfn(Integral Domain)}}} ([[https://mizar.uwb.edu.pl/version/current/html/vectsp_2.html#NM2][~vectsp_2~]]) if it has no zero divisors,
  i.e.,
  - [[https://mizar.uwb.edu.pl/version/current/html/vectsp_2.html#V1][~domRing-like~]]: for any $x,y\in R$, if $xy=0$ then $x=0$ or $y=0$
- *Proposition 2.* Let $R$ be a ring, let $a,b,c\in R$. If $a$ is not
  a zero-divisor and $ab=ac$, then $b=c$. {{{missing()}}}
- *Corollary 3.* Any finite integral domain is a field. {{{missing()}}}
- *Definition.* Let $R$ be a ring. A {{{dfn(Subring)}}} of $R$ is a
  subgroup of $R$ that is closed under multiplication. ([[https://mizar.uwb.edu.pl/version/current/html/c0sp1.html#M1][~c0sp1:def 3~]])
- *Examples.*
  - $\mathbb{Z}$ is a subring of $\mathbb{Q}$ ([[https://mizar.uwb.edu.pl/version/current/html/ring_3.html#T47][~ring_3:47~]])
  - $\mathbb{Q}$ is a subring of $\mathbb{R}$ ([[https://mizar.uwb.edu.pl/version/current/html/liouvil2.html#T4][~liouvil2:4~]])
  - $\mathbb{R}$ is a subring of $\mathbb{C}$ ([[https://mizar.uwb.edu.pl/version/current/html/liouvil2.html#T3][~liouvil2:3~]])
  - The integral quaternions $S=\mathbb{Z}+i\mathbb{Z}+j\mathbb{Z}+k\mathbb{Z}$
    is a subring of the quaternions {{{missing()}}}
  - If $R$ is a subring of a field $F$ that contains the identity,
    then $R$ is an integral domain {{{missing()}}}

** \sect7.2 Examples: Polynomial rings, Matrix rings, and group rings
:PROPERTIES:
:CUSTOM_ID: h-009eb3ec-5c49-481e-af57-53c7e0397747
:END:

