docs/comp-sci/theorem-provers/mizar/rings.html
<div id="outline-container-h-78a9fb8d-458e-4180-974f-4c0119f156dc" class="outline-3">
<h3 id="h-78a9fb8d-458e-4180-974f-4c0119f156dc">&sect;7.1 Basic Definitions and Examples</h3>
<div class="outline-text-3" id="text-h-78a9fb8d-458e-4180-974f-4c0119f156dc">
<ul class="org-ul">
<li><b>Definition.</b> A <dfn>Ring</dfn> \(R\) is a non-empty set with two binary \(+\) and
\(\times\) (called addition and multiplication) such that (<a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#NM3"><code>vectsp_1</code></a>)
<ul class="org-ul">
<li>addition is commutative: for all \(x,y\in R\), we have \(x+y=y+x\) (<a href="https://mizar.uwb.edu.pl/version/current/html/rlvect_1.html#V2"><code>Abelian</code></a>)</li>
<li>associativity of addition \((x+y)+z=x+(y+z)\) for all \(x,y,z\in R\)
(<a href="https://mizar.uwb.edu.pl/version/current/html/rlvect_1.html#V3"><code>add-associative</code></a>)</li>
<li>additive inverse: for each \(x\in R\), there exists a \(y\in R\) such
that \(x+y=0\) (i.e., every element is <a href="https://mizar.uwb.edu.pl/version/current/html/algstr_0.html#V10"><code>right_complementable</code></a>)</li>
<li>additive identity \(x+0=x\) (<a href="https://mizar.uwb.edu.pl/version/current/html/rlvect_1.html#V4"><code>right_zeroed</code></a>) and by commutativity \(0+x=x\) for all \(x\in R\)</li>
<li>multiplication is <a href="https://mizar.uwb.edu.pl/version/current/html/group_1.html#V3">associative</a>: for all \(x,y,z\in R\) we have \((xy)z=x(yz)\)</li>
<li>it is <a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#V4">well-unital</a>: for all \(x\in R\), we have \(x\cdot 1=x\) and
\(1\cdot x=x\)</li>
<li>multiplication is <a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#V5">distributive</a> over addition: for all \(x,y,z\in R\)
we have \(x(y+z)=xy+xz\) and \((x+y)z=xz+yz\)</li>
</ul></li>
<li><b>Remark.</b> This is technically a little "overfitted": Mathematicians
can work with nonassociative rings, and do so all the time.</li>
<li><b>Definition.</b> A ring \(R\) is <dfn>Commutative</dfn> if multiplication
is <a href="https://mizar.uwb.edu.pl/version/current/html/group_1.html#V5">commutative</a>.</li>
<li><b>Definition.</b> A ring \(R\) is said to have an <dfn>Identity</dfn>
(i.e., is <dfn>Unital</dfn>) if there is an element \(1\in R\) such
that for all \(a\in R\) we have \(1\times a=a\times 1=a\).
<ul class="org-ul">
<li><b>Remark.</b> Sadly, Mizar's ring is defined to <i>always</i> be
unital. Therefore we will tend to drop the "unital" prefix.</li>
</ul></li>
<li><b>Implicit Definition.</b> A ring \(R\) is called <dfn>Degenerate</dfn> if
\(1=0\). Otherwise, \(R\) is said to be <dfn>Non-degenerate</dfn>.</li>
<li><b>Definition.</b> A nondegenerate ring \(R\) is called a <dfn>Division Ring</dfn>
(or a <dfn>Skew-Field</dfn>) if every nonzero \(a\in R\) has a
multiplicative inverse (<a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#NM4"><code>vectsp_1</code></a>).</li>
<li><b>Definition.</b> A <dfn>Field</dfn> is a commutative Skew-Field (<a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#NM5"><code>vectsp_1</code></a>).</li>
<li><b>Examples.</b>
<ol class="org-ol">
<li>The integers form a ring, which Mizar calls <a href="https://mizar.uwb.edu.pl/version/current/html/int_3.html#K1"><code>INT.Ring</code></a></li>
<li>The real numbers form a field which Mizar calls <a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#K2"><code>F_Real</code></a></li>
<li>The rational numbers form a field which Mizar calls <a href="https://mizar.uwb.edu.pl/version/current/html/gaussint.html#K11"><code>F_Rat</code></a></li>
<li>The complex numbers form a field which Mizar calls <a href="https://mizar.uwb.edu.pl/version/current/html/complfld.html#K1"><code>F_Complex</code></a></li>
<li>The integers modulo \(n\) forms a commutative ring which Mizar
calls <a href="https://mizar.uwb.edu.pl/version/current/html/int_3.html#K9"><code>INT.Ring n</code></a></li>
<li>The quaternions form a ring \(\mathbb{H}\) which Mizar calls <a href="https://mizar.uwb.edu.pl/version/current/html/quatern2.html#K15"><code>R_Quaternion</code></a></li>
<li>If \(A\) is a ring and \(X\) is a nonempty set, then the set \(R\) of
all functions \(X\to A\) forms a ring <span class="missing">Missing from Mizar</span></li>
</ol></li>
<li><b>Proposition 1.</b> Let \(R\) be a ring. Then
<ol class="org-ol">
<li>For all \(a\in R\) we have \(0a=a0=0\) (<a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#T7"><code>vectsp_1:7</code></a> and <a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#T14"><code>vectsp_1:14</code></a>)</li>
<li>For all \(a,b\in R\) we have
<ul class="org-ul">
<li>(<a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#T8"><code>vectsp_1:8</code></a>) \(a(-b)=-(ab)\)</li>
<li>(<a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#T9"><code>vectsp_1:9</code></a>) \((-a)b=-(ab)\)</li>
</ul></li>
<li>For all \(a,b\in R\) we have \((-a)(-b)=ab\) (<a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#T10"><code>vectsp_1:10</code></a>)</li>
<li>For all \(a\in R\) we have \(-a=(-1)a\) (<a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#T14"><code>vectsp_1:14</code></a>)</li>
</ol></li>
<li><b>Definition.</b> Let \(R\) be a ring.
<ol class="org-ol">
<li>We say \(x\in R\) is a <dfn>Zero Divisor</dfn> if there is a \(y\in R\)
such that \(y\neq0\) and \(xy=0\). Mizar requires \(R\) to be
commutative. (<a href="https://mizar.uwb.edu.pl/version/current/html/ringfrac.html#NM1"><code>ringfrac</code></a>)</li>
<li>If \(R\) is nondegenerate (i.e., \(1\neq0\)), we say \(x\in R\) is
<dfn>Unital</dfn> if there exists some \(y\in R\) such that \(xy=1\)
and \(yx=1\) (<a href="https://mizar.uwb.edu.pl/version/current/html/gcd_1.html#V1"><code>gcd_1:def 2</code></a>)</li>
</ol></li>
<li><b>Examples.</b>
<ul class="org-ul">
<li>The example \(\mathbb{Q}(\sqrt{D})\) where \(D^{2}\notin\mathbb{Q}\)
is a specialized example of adjoining the squareroot of a
nonsquare element of a field. In Mizar, this is done by
<code>FieldAdjunction(F,{sqrt a})</code> (see, e.g., Lemma <a href="https://mizar.uwb.edu.pl/version/current/html/field_9.html#E84"><code>dega</code></a> in
<code>field_9</code>)</li>
</ul></li>
<li><b>Definition.</b> A commutative nondegenerate ring is called an
<dfn>Integral Domain</dfn> (<a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_2.html#NM2"><code>vectsp_2</code></a>) if it has no zero divisors,
i.e.,
<ul class="org-ul">
<li><a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_2.html#V1"><code>domRing-like</code></a>: for any \(x,y\in R\), if \(xy=0\) then \(x=0\) or \(y=0\)</li>
</ul></li>
<li><b>Proposition 2.</b> Let \(R\) be a ring, let \(a,b,c\in R\). If \(a\) is not
a zero-divisor and \(ab=ac\), then \(b=c\). <span class="missing">Missing from Mizar</span></li>
<li><b>Corollary 3.</b> Any finite integral domain is a field. <span class="missing">Missing from Mizar</span></li>
<li><b>Definition.</b> Let \(R\) be a ring. A <dfn>Subring</dfn> of \(R\) is a
subgroup of \(R\) that is closed under multiplication. (<a href="https://mizar.uwb.edu.pl/version/current/html/c0sp1.html#M1"><code>c0sp1:def 3</code></a>)</li>
<li><b>Examples.</b>
<ul class="org-ul">
<li>\(\mathbb{Z}\) is a subring of \(\mathbb{Q}\) (<a href="https://mizar.uwb.edu.pl/version/current/html/ring_3.html#T47"><code>ring_3:47</code></a>)</li>
<li>\(\mathbb{Q}\) is a subring of \(\mathbb{R}\) (<a href="https://mizar.uwb.edu.pl/version/current/html/liouvil2.html#T4"><code>liouvil2:4</code></a>)</li>
<li>\(\mathbb{R}\) is a subring of \(\mathbb{C}\) (<a href="https://mizar.uwb.edu.pl/version/current/html/liouvil2.html#T3"><code>liouvil2:3</code></a>)</li>
<li>The integral quaternions \(S=\mathbb{Z}+i\mathbb{Z}+j\mathbb{Z}+k\mathbb{Z}\)
is a subring of the quaternions <span class="missing">Missing from Mizar</span></li>
<li>If \(R\) is a subring of a field \(F\) that contains the identity,
then \(R\) is an integral domain <span class="missing">Missing from Mizar</span></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-h-009eb3ec-5c49-481e-af57-53c7e0397747" class="outline-3">
<h3 id="h-009eb3ec-5c49-481e-af57-53c7e0397747">&sect;7.2 Examples: Polynomial rings, Matrix rings, and group rings</h3>
<div class="outline-text-3" id="text-h-009eb3ec-5c49-481e-af57-53c7e0397747">
</div>
