comp-sci/theorem-provers/mizar/rings.org
*** Polynomial rings
:PROPERTIES:
:CUSTOM_ID: h-a25efa10-1acd-4d99-bc1b-a73f0963dc61
:END:

Polynomial rings are...well...tricky. After all, it's given an entire
chapter in Dummit and Foote, but it could easily be given its own book.

- *Proposition 4.* Let $R$ be an integral domain, let $p(x)$ and
  $q(x)$ be nonzero elements of $R[x]$. Then
  1. $\deg(p(x)q(x))=\deg(p(x))+\deg(q(x))$
  2. the units of $R[x]$ are just the units of $R$
  3. $R[x]$ is an integral domain

*** Matrix Rings
:PROPERTIES:
:CUSTOM_ID: h-c12a21b9-07aa-438d-8fd2-586a022ddbe5
:END:

This has been formalized in the submitted-but-not-yet-accepted
~matgrp_0~ article.

*** Group Rings
:PROPERTIES:
:CUSTOM_ID: h-06fda95c-cb28-41e3-9f3b-5a8f476a5a15
:END:

{{{missing()}}}

