docs/comp-sci/theorem-provers/mizar/rings.html
<div id="outline-container-h-a25efa10-1acd-4d99-bc1b-a73f0963dc61" class="outline-4">
<h4 id="h-a25efa10-1acd-4d99-bc1b-a73f0963dc61">Polynomial rings</h4>
<div class="outline-text-4" id="text-h-a25efa10-1acd-4d99-bc1b-a73f0963dc61">
<p>
Polynomial rings are&#x2026;well&#x2026;tricky. After all, it's given an entire
chapter in Dummit and Foote, but it could easily be given its own book.
</p>

<ul class="org-ul">
<li><b>Proposition 4.</b> Let \(R\) be an integral domain, let \(p(x)\) and
\(q(x)\) be nonzero elements of \(R[x]\). Then
<ol class="org-ol">
<li>\(\deg(p(x)q(x))=\deg(p(x))+\deg(q(x))\)</li>
<li>the units of \(R[x]\) are just the units of \(R\)</li>
<li>\(R[x]\) is an integral domain</li>
</ol></li>
</ul>
</div>
</div>
<div id="outline-container-h-c12a21b9-07aa-438d-8fd2-586a022ddbe5" class="outline-4">
<h4 id="h-c12a21b9-07aa-438d-8fd2-586a022ddbe5">Matrix Rings</h4>
<div class="outline-text-4" id="text-h-c12a21b9-07aa-438d-8fd2-586a022ddbe5">
<p>
This has been formalized in the submitted-but-not-yet-accepted
<code>matgrp_0</code> article.
</p>
</div>
</div>
