comp-sci/theorem-provers/mizar/rings.org
** \sect7.3 Ring Homomorphisms and Quotient Rings
:PROPERTIES:
:CUSTOM_ID: h-34348abf-a5d4-4900-8268-4f0d9e57a1d4
:END:

- *Definition.* ([[https://mizar.uwb.edu.pl/version/current/html/quofield.html#NV1][~quofield~]]) Let $R$ and $S$ be rings. A {{{dfn(Ring Homomorphism)}}}
  is a map $\varphi\colon R\to S$ such that
  1. [[https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#V13][additive]]: $\varphi(a+b)=\varphi(a)+\varphi(b)$ for all $a,b\in R$
  2. [[https://mizar.uwb.edu.pl/version/current/html/group_6.html#V1][multiplicative]]: $\varphi(ab)=\varphi(a)\varphi(b)$ for all $a,b\in R$
  3. [[https://mizar.uwb.edu.pl/version/current/html/group_1.html#V6][unity-preserving]]: $\varphi(1)=1$
- *Implicit Definition.* Let $R$ and $S$ be rings. We say $S$ is
  {{{dfn($R$-homomorphic)}}} if there exists a ring homomorphism
  $\varphi\colon R\to S$. ([[https://mizar.uwb.edu.pl/version/current/html/ring_2.html#V3][~ring_2:def 4~]])
  This is needed because types in Mizar can't be empty, and we want to
  define ~Homomorphism of R,S~ [[https://mizar.uwb.edu.pl/version/current/html/ring_2.html#NM2][~ring_2~]].
- *Definition.* Let $R$ and $S$ be rings. The {{{dfn(Kernel)}}} of a
  ring homomorphism $\varphi$, denoted $\ker(\varphi)$, is the set of
  elements of $R$ that map to $0$ in $S$. ([[https://mizar.uwb.edu.pl/version/current/html/vectsp10.html#K8][~vectsp10:def 9~]])
- *Definition.* Let $R$ and $S$ be rings. We say a ring homomorphism
  $\varphi\colon R\to S$ is a {{{dfn(Isomorphism)}}} if it is
  bijective (~RingIsomorphism~ is a synonym for ~isomorphism~ defined
  in [[https://mizar.uwb.edu.pl/version/current/html/mod_4.html#V7][~mod_4:def 12~]])
- *Implicit Definition.* Let $R$ and $S$ be rings. We say $R$ is
  {{{dfn(Isomorphic)}}} to $S$ if there exists an isomorphism $R\to S$
  ([[https://mizar.uwb.edu.pl/version/current/html/quofield.html#R2][~quofield:def 23~]]). This is usually denoted $R\cong S$.
- *Example.* Let $R$ be a ring, let $c_{1},\dots,c_{n}\in R$ be elements of $R$. The
  function $e_{c_{1},\dots,c_{n}}\colon R[x_{1},\dots,x_{n}]\to R$,
  defined by sending $x_{i}\mapsto c_{i}$ then evaluating the
  polynomial, is a ring homomorphism. ([[https://mizar.uwb.edu.pl/version/current/html/polynom2.html#K3][~polynom2:def 5~]])
- *Proposition 5.* Let $R$ and $S$ be rings, let $\varphi\colon R\to S$   
  be a ring morphism. Then
  1. The image of $\varphi$ is a subring of $S$ ([[https://mizar.uwb.edu.pl/version/current/html/ring_2.html#K4][~ring_2:def 6~]])
  2. The kernel of $\varphi$ is a subring of $R$.
- *Definition.* Let $R$ be a ring. Let $I\subset R$ be a subset of
  $R$, and let $r\in R$ be an element of $R$.
  1. 
     - ([[https://mizar.uwb.edu.pl/version/current/html/ideal_1.html#K10][~ideal_1:def 18~]]) $rI = \{ra\mid a\in I\}$ and
     - {{{missing()}}} $Ir = \{ar\mid a\in I\}$
  2. A subset $I$ of $R$ is a {{{dfn(Left Ideal)}}} of $R$ ([[https://mizar.uwb.edu.pl/version/current/html/ideal_1.html#NM3][~ideal_1~]]) if
     1. +$I$ is a subring of $R$ and+
        $I$ is [[https://mizar.uwb.edu.pl/version/current/html/ideal_1.html#V1][~add-closed~]]: for any $x,y\in I$, $x+y\in I$
     2. [[https://mizar.uwb.edu.pl/version/current/html/ideal_1.html#V2][~left-ideal~]]: $I$ is closed under left multiplication by elements from $R$,
        i.e., $rI\subset I$ for all $r\in R$
  3. A subset $I$ of $R$ is a {{{dfn(Right Ideal)}}} of $R$ ([[https://mizar.uwb.edu.pl/version/current/html/ideal_1.html#NM2][~ideal_1~]]) if
     1. $I$ is [[https://mizar.uwb.edu.pl/version/current/html/ideal_1.html#V1][~add-closed~]]: for any $x,y\in I$, $x+y\in I$
     2. [[https://mizar.uwb.edu.pl/version/current/html/ideal_1.html#V3][~right-ideal~]]: $Ir\subset I$ for all $r\in R$
  4. A subset $I$ of $R$ is a {{{dfn(Two-Sided Ideal)}}} ([[https://mizar.uwb.edu.pl/version/current/html/ideal_1.html#NM1][~ideal_1~]]) if it is both
     a left and right ideal of $R$
- *Notation:* We write $I\trianglelefteq R$ is $I$ is a two-sided
  ideal of $R$, and $I\triangleleft R$ if $I\neq R$ is a *proper*
  two-sided ideal.
- *Proposition 6.* Let $R$ be a (possibly nonassociative) ring, let
  $I$ be an ideal of $R$. Then $R/I$ is a ring consisting of $a+I$ for
  $a\in R$, addition is defined using $(a+I)+(b+I)=(a+b)+I$,
  multiplication is defined by $(a+I)(b+I)=ab+I$. ([[https://mizar.uwb.edu.pl/version/current/html/ring_1.html#K2][~ring_1:def 6~]])
- *Theorem 7.*
  1. First isomorphism theorem ([[https://mizar.uwb.edu.pl/version/current/html/ring_2.html#T15][~ring_2:15~]]): If $\varphi\colon R\to S$
     is a ring morphism, then $R/\ker(\varphi)\cong\varphi(R)$
  2. If $I$ is any ideal of $R$, then the map $R\to R/I$ defined by
     $r\mapsto r+I$ is a surjective ring morphism with kernel $I$
     which Mizar calls the {{{dfn(Canonical Morphism of $I$)}}}
     ([[https://mizar.uwb.edu.pl/version/current/html/ring_2.html#K3][~ring_2:def 5~]]). Thus every ideal is the kernel of a morphism,
     and vice-versa.
- *Examples.* Let $R$ be a ring.
  1. The subrings $R$ and $\{0\}$ are ideals ([[https://mizar.uwb.edu.pl/version/current/html/ideal_1.html#T10][~ideal_1:10~]]). 

     An ideal $I$ is {{{dfn(proper)}}} if $I\neq R$.

     The ideal $\{0\}$ is called the
     {{{dfn(Trivial Ideal)}}} and denoted by $0$ ([[https://mizar.uwb.edu.pl/version/current/html/ideal_1.html#V4][~ideal_1:def 4~]]).
  2. The sets $n\mathbb{Z}$ are ideals of $\mathbb{Z}$ for any
     $n\in\mathbb{Z}$ (although this is {{{missing()}}}, its
     significance for Dummit and Foote is only to construct
     $\mathbb{Z}/n\mathbb{Z}$ which is done explicitly in Mizar)
  3. Let $R=\mathbb{Z}[x]$ be the ring of polynomials in $x$ with
     integer coefficients. Let $I$ be the set of polynomials whose
     terms are of degree at least 2 (i.e., they all look like
     $a_{n}x^{n}+\dots+a_{2}x^{2}$). Then $I$ is an ideal of $R$. {{{missing()}}}
- *Theorem 8.* Let $R$ be a ring.
  1. Second isomorphism theorem for rings: Let $A$ be a subring of
     $R$, let $I$ be an ideal of $R$. Then $A+I$ is a subring of $R$,
     $A\cap I$ is an ideal of $A$, and $(A+I)/I\cong A/(A\cap I)$
  2. Third isomorphism theorem for rings: Let $I$ and $J$ be ideals of
     $R$ with $I\subset J$. Then $J/I$ is an ideal of $R/I$ and
     $(R/I)/(J/I)\cong R/J$.
  3. Fourth isomorphism theorem for rings: Let $I$ be an ideal of
     $R$. The correspondence $A\leftrightarrow A/I$ is an
     inclusion-preserving bijection between the set of subrings $A$ of
     $R$ which contain $I$ and the set of subrings of
     $R/I$. Furthermore, $A$ (a subring containing $I$) is an ideal of
     $R$ if and only if $A/I$ is an ideal of $R/I$.
- *Definition.* Let $I$ and $J$ be ideals of $R$.
  1. The {{{dfn(Sum)}}} of $I$ and $J$ is $I+J=\{a+b\mid a\in I,b\in J\}$
     ([[https://mizar.uwb.edu.pl/version/current/html/ideal_1.html#K11][~ideal_1:def 19~]])
  2. The {{{dfn(Product)}}} of $I$ and $J$ is the set $IJ$ of all finite
     sums of terms of the form $ab$ with $a\in I$ and $b\in J$
     ([[https://mizar.uwb.edu.pl/version/current/html/ideal_1.html#K14][~ideal_1:def 21~]])
  3. For any $n\geq1$, define the {{{dfn(n-th power)}}} of $I$,
     denoted by $I^{n}$, to be the set consisting of all finite sums
     of elements of the form $a_{1}a_{2}(\dots)a_{n}$ for $a_{i}\in I$
     for all $i$. That is to say $I^{1}=I$ and $I^{n+1}=II^{n}$
     ([[https://mizar.uwb.edu.pl/version/current/html/ideal_2.html#K3][~ideal_2:def 2~]])

