docs/comp-sci/theorem-provers/mizar/rings.html
<div id="outline-container-h-06fda95c-cb28-41e3-9f3b-5a8f476a5a15" class="outline-4">
<h4 id="h-06fda95c-cb28-41e3-9f3b-5a8f476a5a15">Group Rings</h4>
<div class="outline-text-4" id="text-h-06fda95c-cb28-41e3-9f3b-5a8f476a5a15">
<p>
<span class="missing">Missing from Mizar</span>
</p>
</div>
</div>
</div>
<div id="outline-container-h-34348abf-a5d4-4900-8268-4f0d9e57a1d4" class="outline-3">
<h3 id="h-34348abf-a5d4-4900-8268-4f0d9e57a1d4">&sect;7.3 Ring Homomorphisms and Quotient Rings</h3>
<div class="outline-text-3" id="text-h-34348abf-a5d4-4900-8268-4f0d9e57a1d4">
<ul class="org-ul">
<li><b>Definition.</b> (<a href="https://mizar.uwb.edu.pl/version/current/html/quofield.html#NV1"><code>quofield</code></a>) Let \(R\) and \(S\) be rings. A <dfn>Ring Homomorphism</dfn>
is a map \(\varphi\colon R\to S\) such that
<ol class="org-ol">
<li><a href="https://mizar.uwb.edu.pl/version/current/html/vectsp_1.html#V13">additive</a>: \(\varphi(a+b)=\varphi(a)+\varphi(b)\) for all \(a,b\in R\)</li>
<li><a href="https://mizar.uwb.edu.pl/version/current/html/group_6.html#V1">multiplicative</a>: \(\varphi(ab)=\varphi(a)\varphi(b)\) for all \(a,b\in R\)</li>
<li><a href="https://mizar.uwb.edu.pl/version/current/html/group_1.html#V6">unity-preserving</a>: \(\varphi(1)=1\)</li>
</ol></li>
<li><b>Implicit Definition.</b> Let \(R\) and \(S\) be rings. We say \(S\) is
<dfn>$R$-homomorphic</dfn> if there exists a ring homomorphism
\(\varphi\colon R\to S\). (<a href="https://mizar.uwb.edu.pl/version/current/html/ring_2.html#V3"><code>ring_2:def 4</code></a>)
This is needed because types in Mizar can't be empty, and we want to
define <code>Homomorphism of R,S</code> <a href="https://mizar.uwb.edu.pl/version/current/html/ring_2.html#NM2"><code>ring_2</code></a>.</li>
<li><b>Definition.</b> Let \(R\) and \(S\) be rings. The <dfn>Kernel</dfn> of a
ring homomorphism \(\varphi\), denoted \(\ker(\varphi)\), is the set of
elements of \(R\) that map to \(0\) in \(S\). (<a href="https://mizar.uwb.edu.pl/version/current/html/vectsp10.html#K8"><code>vectsp10:def 9</code></a>)</li>
<li><b>Definition.</b> Let \(R\) and \(S\) be rings. We say a ring homomorphism
\(\varphi\colon R\to S\) is a <dfn>Isomorphism</dfn> if it is
bijective (<code>RingIsomorphism</code> is a synonym for <code>isomorphism</code> defined
in <a href="https://mizar.uwb.edu.pl/version/current/html/mod_4.html#V7"><code>mod_4:def 12</code></a>)</li>
<li><b>Implicit Definition.</b> Let \(R\) and \(S\) be rings. We say \(R\) is
<dfn>Isomorphic</dfn> to \(S\) if there exists an isomorphism \(R\to S\)
(<a href="https://mizar.uwb.edu.pl/version/current/html/quofield.html#R2"><code>quofield:def 23</code></a>). This is usually denoted \(R\cong S\).</li>
<li><b>Example.</b> Let \(R\) be a ring, let \(c_{1},\dots,c_{n}\in R\) be elements of \(R\). The
function \(e_{c_{1},\dots,c_{n}}\colon R[x_{1},\dots,x_{n}]\to R\),
defined by sending \(x_{i}\mapsto c_{i}\) then evaluating the
polynomial, is a ring homomorphism. (<a href="https://mizar.uwb.edu.pl/version/current/html/polynom2.html#K3"><code>polynom2:def 5</code></a>)</li>
<li><b>Proposition 5.</b> Let \(R\) and \(S\) be rings, let \(\varphi\colon R\to S\)   
be a ring morphism. Then
<ol class="org-ol">
<li>The image of \(\varphi\) is a subring of \(S\) (<a href="https://mizar.uwb.edu.pl/version/current/html/ring_2.html#K4"><code>ring_2:def 6</code></a>)</li>
<li>The kernel of \(\varphi\) is a subring of \(R\).</li>
</ol></li>
<li><b>Definition.</b> Let \(R\) be a ring. Let \(I\subset R\) be a subset of
\(R\), and let \(r\in R\) be an element of \(R\).
<ol class="org-ol">
<li><ul class="org-ul">
<li>(<a href="https://mizar.uwb.edu.pl/version/current/html/ideal_1.html#K10"><code>ideal_1:def 18</code></a>) \(rI = \{ra\mid a\in I\}\) and</li>
<li><span class="missing">Missing from Mizar</span> \(Ir = \{ar\mid a\in I\}\)</li>
</ul></li>
<li>A subset \(I\) of \(R\) is a <dfn>Left Ideal</dfn> of \(R\) (<a href="https://mizar.uwb.edu.pl/version/current/html/ideal_1.html#NM3"><code>ideal_1</code></a>) if
<ol class="org-ol">
<li><del>\(I\) is a subring of \(R\) and</del>
\(I\) is <a href="https://mizar.uwb.edu.pl/version/current/html/ideal_1.html#V1"><code>add-closed</code></a>: for any \(x,y\in I\), \(x+y\in I\)</li>
<li><a href="https://mizar.uwb.edu.pl/version/current/html/ideal_1.html#V2"><code>left-ideal</code></a>: \(I\) is closed under left multiplication by elements from \(R\),
i.e., \(rI\subset I\) for all \(r\in R\)</li>
</ol></li>
<li>A subset \(I\) of \(R\) is a <dfn>Right Ideal</dfn> of \(R\) (<a href="https://mizar.uwb.edu.pl/version/current/html/ideal_1.html#NM2"><code>ideal_1</code></a>) if
<ol class="org-ol">
<li>\(I\) is <a href="https://mizar.uwb.edu.pl/version/current/html/ideal_1.html#V1"><code>add-closed</code></a>: for any \(x,y\in I\), \(x+y\in I\)</li>
<li><a href="https://mizar.uwb.edu.pl/version/current/html/ideal_1.html#V3"><code>right-ideal</code></a>: \(Ir\subset I\) for all \(r\in R\)</li>
</ol></li>
<li>A subset \(I\) of \(R\) is a <dfn>Two-Sided Ideal</dfn> (<a href="https://mizar.uwb.edu.pl/version/current/html/ideal_1.html#NM1"><code>ideal_1</code></a>) if it is both
a left and right ideal of \(R\)</li>
</ol></li>
<li><b>Notation:</b> We write \(I\trianglelefteq R\) is \(I\) is a two-sided
ideal of \(R\), and \(I\triangleleft R\) if \(I\neq R\) is a <b>proper</b>
two-sided ideal.</li>
<li><b>Proposition 6.</b> Let \(R\) be a (possibly nonassociative) ring, let
\(I\) be an ideal of \(R\). Then \(R/I\) is a ring consisting of \(a+I\) for
\(a\in R\), addition is defined using \((a+I)+(b+I)=(a+b)+I\),
multiplication is defined by \((a+I)(b+I)=ab+I\). (<a href="https://mizar.uwb.edu.pl/version/current/html/ring_1.html#K2"><code>ring_1:def 6</code></a>)</li>
<li><b>Theorem 7.</b>
<ol class="org-ol">
<li>First isomorphism theorem (<a href="https://mizar.uwb.edu.pl/version/current/html/ring_2.html#T15"><code>ring_2:15</code></a>): If \(\varphi\colon R\to S\)
is a ring morphism, then \(R/\ker(\varphi)\cong\varphi(R)\)</li>
<li>If \(I\) is any ideal of \(R\), then the map \(R\to R/I\) defined by
\(r\mapsto r+I\) is a surjective ring morphism with kernel \(I\)
which Mizar calls the <dfn>Canonical Morphism of \(I\)</dfn>
(<a href="https://mizar.uwb.edu.pl/version/current/html/ring_2.html#K3"><code>ring_2:def 5</code></a>). Thus every ideal is the kernel of a morphism,
and vice-versa.</li>
</ol></li>
<li><b>Examples.</b> Let \(R\) be a ring.
<ol class="org-ol">
<li><p>
The subrings \(R\) and \(\{0\}\) are ideals (<a href="https://mizar.uwb.edu.pl/version/current/html/ideal_1.html#T10"><code>ideal_1:10</code></a>). 
</p>

<p>
An ideal \(I\) is <dfn>proper</dfn> if \(I\neq R\).
</p>

<p>
The ideal \(\{0\}\) is called the
<dfn>Trivial Ideal</dfn> and denoted by \(0\) (<a href="https://mizar.uwb.edu.pl/version/current/html/ideal_1.html#V4"><code>ideal_1:def 4</code></a>).
</p></li>
<li>The sets \(n\mathbb{Z}\) are ideals of \(\mathbb{Z}\) for any
\(n\in\mathbb{Z}\) (although this is <span class="missing">Missing from Mizar</span>, its
significance for Dummit and Foote is only to construct
\(\mathbb{Z}/n\mathbb{Z}\) which is done explicitly in Mizar)</li>
<li>Let \(R=\mathbb{Z}[x]\) be the ring of polynomials in \(x\) with
integer coefficients. Let \(I\) be the set of polynomials whose
terms are of degree at least 2 (i.e., they all look like
\(a_{n}x^{n}+\dots+a_{2}x^{2}\)). Then \(I\) is an ideal of \(R\). <span class="missing">Missing from Mizar</span></li>
</ol></li>
<li><b>Theorem 8.</b> Let \(R\) be a ring.
<ol class="org-ol">
<li>Second isomorphism theorem for rings: Let \(A\) be a subring of
\(R\), let \(I\) be an ideal of \(R\). Then \(A+I\) is a subring of \(R\),
\(A\cap I\) is an ideal of \(A\), and \((A+I)/I\cong A/(A\cap I)\)</li>
<li>Third isomorphism theorem for rings: Let \(I\) and \(J\) be ideals of
\(R\) with \(I\subset J\). Then \(J/I\) is an ideal of \(R/I\) and
\((R/I)/(J/I)\cong R/J\).</li>
<li>Fourth isomorphism theorem for rings: Let \(I\) be an ideal of
\(R\). The correspondence \(A\leftrightarrow A/I\) is an
inclusion-preserving bijection between the set of subrings \(A\) of
\(R\) which contain \(I\) and the set of subrings of
\(R/I\). Furthermore, \(A\) (a subring containing \(I\)) is an ideal of
\(R\) if and only if \(A/I\) is an ideal of \(R/I\).</li>
</ol></li>
<li><b>Definition.</b> Let \(I\) and \(J\) be ideals of \(R\).
<ol class="org-ol">
<li>The <dfn>Sum</dfn> of \(I\) and \(J\) is \(I+J=\{a+b\mid a\in I,b\in J\}\)
(<a href="https://mizar.uwb.edu.pl/version/current/html/ideal_1.html#K11"><code>ideal_1:def 19</code></a>)</li>
<li>The <dfn>Product</dfn> of \(I\) and \(J\) is the set \(IJ\) of all finite
sums of terms of the form \(ab\) with \(a\in I\) and \(b\in J\)
(<a href="https://mizar.uwb.edu.pl/version/current/html/ideal_1.html#K14"><code>ideal_1:def 21</code></a>)</li>
<li>For any \(n\geq1\), define the <dfn>n-th power</dfn> of \(I\),
denoted by \(I^{n}\), to be the set consisting of all finite sums
of elements of the form \(a_{1}a_{2}(\dots)a_{n}\) for \(a_{i}\in I\)
for all \(i\). That is to say \(I^{1}=I\) and \(I^{n+1}=II^{n}\)
(<a href="https://mizar.uwb.edu.pl/version/current/html/ideal_2.html#K3"><code>ideal_2:def 2</code></a>)</li>
</ol></li>
</ul>
</div>
</div>
