comp-sci/theorem-provers/mizar/rings.org
** \sect7.4 Properties of Ideals
:PROPERTIES:
:CUSTOM_ID: h-b13d8f59-7a70-4b7e-8dad-354a4e5c7b97
:END:

- *Definition.* Let $A$ be any subset of the ring $R$.
  1. The {{{dfn(Ideal Generated by $A$)}}} is the smallest ideal $(A)$
     of $R$ containing $A$ ([[https://mizar.uwb.edu.pl/version/current/html/ideal_1.html#K7][~ideal_1:def 14~]]); this also generalizes
     to "left ideals generated by $A$" and "right ideals generated by $A$"
  2. Let $AR=\{\sum^{n}_{i=1}a_{i}r_{i}\mid n\in\mathbb{N},a_{i}\in A,r_{i}\in R\}$
     and $RA=\{\sum^{n}_{i=1}r_{i}a_{i}\mid n\in\mathbb{N},a_{i}\in A,r_{i}\in R\}$
  3. A {{{dfn(Principal Ideal)}}} is the ideal generated by a single
     element
     ([[https://mizar.uwb.edu.pl/version/current/html/ideal_1.html#V7][~ideal_1:def 27~]])
  4. An ideal generated by a finite set is called a
     {{{dfn(Finitely-Generated Ideal)}}}
     ([[https://mizar.uwb.edu.pl/version/current/html/ideal_1.html#V5][~ideal_1:def 25~]])
- *Proposition 9.* Let $I$ be an ideal of $R$.
  1. $I=R$ if and only if $I$ contains a unit ([[https://mizar.uwb.edu.pl/version/current/html/ideal_1.html#T20][~ideal_1:20~]])
  2. Assume $R$ is commutative. Then $R$ is a field if and only if its
     only ideals are $0$ and $R$. ([[https://mizar.uwb.edu.pl/version/current/html/ideal_1.html#T22][~ideal_1:22~]])
- *Corollary 10.* If $R$ is a field, then any nonzero ring
  homomorphism from $R$ into another ring is an injection. {{{missing()}}}
- *Definition.* An ideal $M$ in an arbitrary ring $S$ is called a
  {{{dfn(Maximal Ideal)}}} if $M\neq S$ and the only ideals containing
  $M$ are $M$ and $S$. ([[https://mizar.uwb.edu.pl/version/current/html/ring_1.html#V4][~ring_1:def 4~]])
- *Proposition 11.* In a unital ring, every proper ideal is contained
  in a maximal ideal. ([[https://mizar.uwb.edu.pl/version/current/html/field_11.html#M1][~field_11:def 8~]])
- *Proposition 12.* Let $R$ be a commutative ring. The ideal $M$ is a
  maximal ideal if and only if the quotient ring $R/M$ is a field.
  ([[https://mizar.uwb.edu.pl/version/current/html/ring_1.html#T21][~ring_1:21~]])
- *Definition.* Let $R$ be a commutative ring. An ideal $P$ of $R$ is
  called a {{{dfn(Prime Ideal)}}} if $P\neq R$ and whenever $ab\in P$
  then either $a\in P$ or $b\in P$
  ([[https://mizar.uwb.edu.pl/version/current/html/ring_1.html#V2][~ring_1:def 2~]])
- *Proposition 13.* Let $R$ be a commutative ring. Then $P$ is a prime
  ideal in $R$ if and only if the quotient ring $R/P$ is an integral domain
  ([[https://mizar.uwb.edu.pl/version/current/html/ring_1.html#T18][~ring_1:18~]])
- *Corollary 14.* Let $R$ be a commutative ring. Then every maximal
  ideal of $R$ is a prime ideal. This is a [[https://mizar.uwb.edu.pl/version/current/html/ring_1.html#CC5][registered fact]] in ~ring_1~.

** \sect7.5 Rings of Fractions
:PROPERTIES:
:CUSTOM_ID: h-96e6d9da-c968-4275-8de7-dd325aa10412
:END:

- *Theorem 15.* Let $R$ be a commutative ring, let $D$ be any nonempty
  subset of $R$ which does not contain $0\notin D$, and $D$ does not
  contain any zero-divisors, and $D$ is closed under
  multiplication. Then there exists a commutative unital ring $Q$ such
  that $Q$ contains $R$ as a subring and every element of $D$ is a
  unit in $Q$. The ring $Q$ also has the following properties:
  1. Every element of $Q$ is of the form $rd^{-1}$ for some $r\in R$
     and $d\in D$.
  2. (Uniqueness of $Q$) The ring $Q$ is the "smallest" ring
     containing $R$ in which all elements of $D$ are units, in the
     sense that for any commutative unital ring $S$ and for any
     injective ring morphism $\varphi\colon R\to S$ such that
     $\varphi(d)$ is a unit for all $d\in D$, then there exists an
     injective ring morphism $\Phi\colon Q\to S$ such that $\Phi|_{R}=\varphi$
- *Definition.* Let $R$, $D$, $Q$ be as in Theorem 15.
  1. The ring $Q$ is called the {{{dfn(Ring of Fractions)}}} of $D$
     with respect to $R$ and is denoted $Q^{-1}R$
     ([[https://mizar.uwb.edu.pl/version/current/html/ringfrac.html#K15][~ringfrac:def 18~]]). Mizar uses the notation =Q ~ R= instead of $Q^{-1}R$.
  2. If $R$ is an integral domain and $D=R\setminus\{0\}$, then $Q$ is
     called the {{{dfn(Field of Fractions)}}} or {{{dfn(Quotient Field)}}}
     of $R$; this is defined for any nondegenerate unital commutative
     ring, where it's called the {{{dfn(Total Quotient Ring)}}}
     ([[https://mizar.uwb.edu.pl/version/current/html/ringfrac.html#K21][~ringfrac:def 24~]]).
- *Corollary 16.* Let $R$ be an integral domain, let $Q$ be the field
  of fractions of $R$. If a field $F$ contains a subring $R'$
  isomorphic to $R$, then the subfield of $F$ generated by $R'$ is
  isomorphic to $Q$. (This is the universal property of the ring of
  fractions, and is formalized in [[https://mizar.uwb.edu.pl/version/current/html/ringfrac.html#K20][~ringfrac:def 23~]])

* Ch. 8 Euclidean Domains, Principal Ideal Domains, Unique Factorization Domains
:PROPERTIES:
:CUSTOM_ID: h-08861cef-f5d4-4a68-8228-33091768796a
:END:

