docs/comp-sci/theorem-provers/mizar/rings.html
<div id="outline-container-h-b13d8f59-7a70-4b7e-8dad-354a4e5c7b97" class="outline-3">
<h3 id="h-b13d8f59-7a70-4b7e-8dad-354a4e5c7b97">&sect;7.4 Properties of Ideals</h3>
<div class="outline-text-3" id="text-h-b13d8f59-7a70-4b7e-8dad-354a4e5c7b97">
<ul class="org-ul">
<li><b>Definition.</b> Let \(A\) be any subset of the ring \(R\).
<ol class="org-ol">
<li>The <dfn>Ideal Generated by \(A\)</dfn> is the smallest ideal \((A)\)
of \(R\) containing \(A\) (<a href="https://mizar.uwb.edu.pl/version/current/html/ideal_1.html#K7"><code>ideal_1:def 14</code></a>); this also generalizes
to "left ideals generated by \(A\)" and "right ideals generated by \(A\)"</li>
<li>Let \(AR=\{\sum^{n}_{i=1}a_{i}r_{i}\mid n\in\mathbb{N},a_{i}\in A,r_{i}\in R\}\)
and \(RA=\{\sum^{n}_{i=1}r_{i}a_{i}\mid n\in\mathbb{N},a_{i}\in A,r_{i}\in R\}\)</li>
<li>A <dfn>Principal Ideal</dfn> is the ideal generated by a single
element
(<a href="https://mizar.uwb.edu.pl/version/current/html/ideal_1.html#V7"><code>ideal_1:def 27</code></a>)</li>
<li>An ideal generated by a finite set is called a
<dfn>Finitely-Generated Ideal</dfn>
(<a href="https://mizar.uwb.edu.pl/version/current/html/ideal_1.html#V5"><code>ideal_1:def 25</code></a>)</li>
</ol></li>
<li><b>Proposition 9.</b> Let \(I\) be an ideal of \(R\).
<ol class="org-ol">
<li>\(I=R\) if and only if \(I\) contains a unit (<a href="https://mizar.uwb.edu.pl/version/current/html/ideal_1.html#T20"><code>ideal_1:20</code></a>)</li>
<li>Assume \(R\) is commutative. Then \(R\) is a field if and only if its
only ideals are \(0\) and \(R\). (<a href="https://mizar.uwb.edu.pl/version/current/html/ideal_1.html#T22"><code>ideal_1:22</code></a>)</li>
</ol></li>
<li><b>Corollary 10.</b> If \(R\) is a field, then any nonzero ring
homomorphism from \(R\) into another ring is an injection. <span class="missing">Missing from Mizar</span></li>
<li><b>Definition.</b> An ideal \(M\) in an arbitrary ring \(S\) is called a
<dfn>Maximal Ideal</dfn> if \(M\neq S\) and the only ideals containing
\(M\) are \(M\) and \(S\). (<a href="https://mizar.uwb.edu.pl/version/current/html/ring_1.html#V4"><code>ring_1:def 4</code></a>)</li>
<li><b>Proposition 11.</b> In a unital ring, every proper ideal is contained
in a maximal ideal. (<a href="https://mizar.uwb.edu.pl/version/current/html/field_11.html#M1"><code>field_11:def 8</code></a>)</li>
<li><b>Proposition 12.</b> Let \(R\) be a commutative ring. The ideal \(M\) is a
maximal ideal if and only if the quotient ring \(R/M\) is a field.
(<a href="https://mizar.uwb.edu.pl/version/current/html/ring_1.html#T21"><code>ring_1:21</code></a>)</li>
<li><b>Definition.</b> Let \(R\) be a commutative ring. An ideal \(P\) of \(R\) is
called a <dfn>Prime Ideal</dfn> if \(P\neq R\) and whenever \(ab\in P\)
then either \(a\in P\) or \(b\in P\)
(<a href="https://mizar.uwb.edu.pl/version/current/html/ring_1.html#V2"><code>ring_1:def 2</code></a>)</li>
<li><b>Proposition 13.</b> Let \(R\) be a commutative ring. Then \(P\) is a prime
ideal in \(R\) if and only if the quotient ring \(R/P\) is an integral domain
(<a href="https://mizar.uwb.edu.pl/version/current/html/ring_1.html#T18"><code>ring_1:18</code></a>)</li>
<li><b>Corollary 14.</b> Let \(R\) be a commutative ring. Then every maximal
ideal of \(R\) is a prime ideal. This is a <a href="https://mizar.uwb.edu.pl/version/current/html/ring_1.html#CC5">registered fact</a> in <code>ring_1</code>.</li>
</ul>
</div>
</div>
<div id="outline-container-h-96e6d9da-c968-4275-8de7-dd325aa10412" class="outline-3">
<h3 id="h-96e6d9da-c968-4275-8de7-dd325aa10412">&sect;7.5 Rings of Fractions</h3>
<div class="outline-text-3" id="text-h-96e6d9da-c968-4275-8de7-dd325aa10412">
<ul class="org-ul">
<li><b>Theorem 15.</b> Let \(R\) be a commutative ring, let \(D\) be any nonempty
subset of \(R\) which does not contain \(0\notin D\), and \(D\) does not
contain any zero-divisors, and \(D\) is closed under
multiplication. Then there exists a commutative unital ring \(Q\) such
that \(Q\) contains \(R\) as a subring and every element of \(D\) is a
unit in \(Q\). The ring \(Q\) also has the following properties:
<ol class="org-ol">
<li>Every element of \(Q\) is of the form \(rd^{-1}\) for some \(r\in R\)
and \(d\in D\).</li>
<li>(Uniqueness of \(Q\)) The ring \(Q\) is the "smallest" ring
containing \(R\) in which all elements of \(D\) are units, in the
sense that for any commutative unital ring \(S\) and for any
injective ring morphism \(\varphi\colon R\to S\) such that
\(\varphi(d)\) is a unit for all \(d\in D\), then there exists an
injective ring morphism \(\Phi\colon Q\to S\) such that \(\Phi|_{R}=\varphi\)</li>
</ol></li>
<li><b>Definition.</b> Let \(R\), \(D\), \(Q\) be as in Theorem 15.
<ol class="org-ol">
<li>The ring \(Q\) is called the <dfn>Ring of Fractions</dfn> of \(D\)
with respect to \(R\) and is denoted \(Q^{-1}R\)
(<a href="https://mizar.uwb.edu.pl/version/current/html/ringfrac.html#K15"><code>ringfrac:def 18</code></a>). Mizar uses the notation <code>Q ~ R</code> instead of \(Q^{-1}R\).</li>
<li>If \(R\) is an integral domain and \(D=R\setminus\{0\}\), then \(Q\) is
called the <dfn>Field of Fractions</dfn> or <dfn>Quotient Field</dfn>
of \(R\); this is defined for any nondegenerate unital commutative
ring, where it's called the <dfn>Total Quotient Ring</dfn>
(<a href="https://mizar.uwb.edu.pl/version/current/html/ringfrac.html#K21"><code>ringfrac:def 24</code></a>).</li>
</ol></li>
<li><b>Corollary 16.</b> Let \(R\) be an integral domain, let \(Q\) be the field
of fractions of \(R\). If a field \(F\) contains a subring \(R'\)
isomorphic to \(R\), then the subfield of \(F\) generated by \(R'\) is
isomorphic to \(Q\). (This is the universal property of the ring of
fractions, and is formalized in <a href="https://mizar.uwb.edu.pl/version/current/html/ringfrac.html#K20"><code>ringfrac:def 23</code></a>)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-h-08861cef-f5d4-4a68-8228-33091768796a" class="outline-2">
<h2 id="h-08861cef-f5d4-4a68-8228-33091768796a">Ch. 8 Euclidean Domains, Principal Ideal Domains, Unique Factorization Domains</h2>
<div class="outline-text-2" id="text-h-08861cef-f5d4-4a68-8228-33091768796a">
</div>
