comp-sci/theorem-provers/mizar/rings.org
** \sect8.1 Euclidean Domains
:PROPERTIES:
:CUSTOM_ID: h-181e0416-2977-4b12-b516-690e0b3b8e01
:END:

- *Definition.* The integral domain $R$ is said to be a
  {{{dfn(Euclidean Domain)}}} if there exists a function $N\colon R\to\mathbb{N}_{0}$
  with $N(0)=0$ and for any $a,b\in R$ with $b\neq0$ there exists
  elements $q,r\in R$ such that $a=qb+r$ and $r=0$ or $N(r)\lt N(b)$
  ([[https://mizar.uwb.edu.pl/version/current/html/int_3.html#V1][~int_3:def 8~]])

  The function $N$ is called the {{{dfn(Degree Function)}}} in Mizar
  ([[https://mizar.uwb.edu.pl/version/current/html/int_3.html#M1][~int_3:def 9~]]).
- *Proposition 1.* Every ideal in a Euclidean domain is principal;
  i.e., if $I$ is any nonzero ideal in the Euclidean domain $R$, then
  there exists a $d\in R$ such that $I=(d)$.
  ([[https://mizar.uwb.edu.pl/version/current/html/ideal_1.html#T94][~ideal_1:94~]])
- *Definition.* Let $R$ be a commutative ring, let $a,b\in R$ with $b\neq0$.
  1. We say $a$ is a {{{dfn(multiple)}}} of $b$ if there exists an
     element $x\in R$ with $a=bx$. In this case, we also say $b$
     {{{dfn(Divides)}}} $a$
     ([[https://mizar.uwb.edu.pl/version/current/html/gcd_1.html#R1][~gcd_1:def 1~]])
  2. A {{{dfn(Greatest Common Divisor)}}} of $a$ and $b$ is a nonzero
     element $d$ such that $d$ divides $a$, and $d$ divides $b$, and
     for any other $d'\in R$ if $d'$ divides both $a$ and $b$ then
     $d'$ divides $d$.
     (This is generalized in [[https://mizar.uwb.edu.pl/version/current/html/gcd_1.html#K5][~gcd_1:def 12~]] and especially [[https://mizar.uwb.edu.pl/version/current/html/ring_4.html#V4][~ring_4:def 10~]])
- *Proposition 2.* If $a$ and $b$ are elements of a commutative ring
  $R$ such that the ideal generated by $a$ and $b$ is a principal
  ideal $(d)$, then $d$ is a greatest common divisor of $a$ and $b$
  {{{missing()}}}
- *Proposition 3.* Let $R$ be an integral domain. If two elements $d$
  and $d'$ of $R$ generate the same principal ideal $(d)=(d')$, then
  $d'=ud$ for some unit $u\in R$.
  ([[https://mizar.uwb.edu.pl/version/current/html/ring_2.html#T21][~ring_2:21~]])
- *Theorem 4.* Let $R$ be a Euclidian domain, let $a$ and $b$ be
  nonzero elements of $R$. Let $d=r_{n}$ be the last nonzero remainder
  in the Euclidian algorithm. Then
  1. $d$ is a greatest common divisor of $a$ and $b$ ({{{missing()}}}), and
  2. The principal ideal $(d)$ is the ideal generated by $a$ and $b$
     ({{{missing()}}} but seems to follow from [[https://mizar.uwb.edu.pl/version/current/html/ring_2.html#T18][~ring_2:18~]])
- *Proposition 5.* Let $R$ be an integral domain that is not a
  field. If $R$ is a Euclidian domain, then there are universal side
  divisors in $R$.

** \sect8.2 Principal Ideal Domains
:PROPERTIES:
:CUSTOM_ID: h-f4dae11f-3f15-486f-bcd3-d5bd8c5bc045
:END:

- *Definition.* A {{{dfn(Principal Ideal Domain)}}} (PID) is an
  integral domain in which every ideal is principal ([[https://mizar.uwb.edu.pl/version/current/html/ideal_1.html#V8][~ideal_1:def 28~]]
  and [[https://mizar.uwb.edu.pl/version/current/html/ring_2.html#NM5][~ring_2~]]).
- *Proposition 6.* Let $R$ be a principal ideal domain, let $a$ and
  $b$ be nonzero elements of $R$. Let $d$ be a generator for the ideal
  generated by $a$ and $b$. Then
  1. $d$ is a greatest common divisor of $a$ and $b$ {{{missing()}}}
  2. $d$ can be written as an $R$-linear combination of $a$ and $b$,
     i.e., there exists $x$ and $y$ in $R$ with $d=ax+by$ {{{missing()}}}
  3. $d$ is unique up to multiplication by a unit of $R$ {{{missing()}}}
- *Proposition 7.* Every nonzero prime ideal in a principal ideal
  domain is a maximal ideal.
  ([[https://mizar.uwb.edu.pl/version/current/html/ring_2.html#T26][~ring_2:26~]])
- *Corollary 8.* If $R$ is any commutative ring such that the
  polynomial ring $R[x]$ is a principal ideal domain (or a Euclidian
  domain), then $R$ is necessarily a field. {{{missing()}}}
- *Definition.* Define $N$ to be a {{{dfn(Dedekind-Hasse norm)}}} if
  $N$ is a positive norm and for every nonzero $a,b\in R$ either $a$
  is an element of the ideal $(b)$ or there is a nonzero element in
  the ideal $(a,b)$ of norm strictly less than the norm of $(b)$
  (i.e., either $b$ divides $a$ in $R$, or there exists $s,t\in R$
  with $0\lt N(sa-tb)\lt N(b)$) {{{missing()}}}
- *Proposition 9.* The integral domain $R$ is a PID if and only if $R$
  has a Dedekind-Hasse norm. {{{missing()}}}

** \sect8.3 Unique Factorization Domains
:PROPERTIES:
:CUSTOM_ID: h-2158426a-1061-4e09-be8d-2ae8fe5a9c85
:END:

- *Definition.* Let $R$ be an integral domain
  - Suppose $r\in R$ is nonzero and is not a unit. Then $r$ is called
    {{{dfn(Irreducible)}}} if whenever $r=ab$ with $a,b\in R$, then 
    either $a$ is a unit in $R$ or $b$ is a unit in $R$ or both;
    otherwise $r$ is called {{{dfn(Reducible)}}}
    ([[https://mizar.uwb.edu.pl/version/current/html/ring_2.html#V5][~ring_2:def 9~]])
  - The nonzero element $p\in R$ is called {{{dfn(Prime)}}} in $R$ if
    the ideal $(p)$ generated by $p$ is a prime ideal. In other words,
    a nonzero element $p$ is prime if it is not a unit and whenever
    $p\mid ab$ either $p\mid a$ or $p\mid b$
    ([[https://mizar.uwb.edu.pl/version/current/html/ring_2.html#V4][~ring_2:def 8~]])
  - Two elements $a,b\in R$ differing by a unit are said to be
    {{{dfn(Associated)}}} if $a=ub$ for some unit $u\in R$
    ([[https://mizar.uwb.edu.pl/version/current/html/gcd_1.html#R3][~gcd_1:def 3~]])
- *Proposition 10.* In an integral domain a prime element is always
  irreducible. (Registered in [[https://mizar.uwb.edu.pl/version/current/html/ring_2.html#CC7][~ring_2~]])
- *Proposition 11.* In a PID, a nonzero element is prime iff it is
  irreducible ([[https://mizar.uwb.edu.pl/version/current/html/ring_2.html#T26][~ring_2:26~]])
- *Definition.* A {{{dfn(Unique Factorization Domain)}}} (UFD, [[https://mizar.uwb.edu.pl/version/current/html/ring_2.html#V8][~ring_2:def 15~]]) is an
  integral domain $R$ in which every nonzero element $r\in R$ which is
  not a unit has the following two properties
  1. $r$ can be written as a finite product of irreducibles $p_{i}$ of
     $R$, i.e., $r=p_{1}p_{2}\dots p_{n}$; and
  2. the decomposition in (1) is unique up to associates
- *Proposition 12.* In a UFD, a nonzero element is prime iff it is
  irreducible. 
- *Theorem 14.* Every principal ideal domain is a unique factorization
  domain. (This is a registered fact in [[https://mizar.uwb.edu.pl/version/current/html/ring_2.html#CC18][~ring_2~]])

* Ch. 9 Polynomial Rings
:PROPERTIES:
:CUSTOM_ID: h-a1d9ea93-b470-4d40-b8f8-f1b6a318547b
:END:

