docs/comp-sci/theorem-provers/mizar/rings.html
<div id="outline-container-h-181e0416-2977-4b12-b516-690e0b3b8e01" class="outline-3">
<h3 id="h-181e0416-2977-4b12-b516-690e0b3b8e01">&sect;8.1 Euclidean Domains</h3>
<div class="outline-text-3" id="text-h-181e0416-2977-4b12-b516-690e0b3b8e01">
<ul class="org-ul">
<li><p>
<b>Definition.</b> The integral domain \(R\) is said to be a
<dfn>Euclidean Domain</dfn> if there exists a function \(N\colon R\to\mathbb{N}_{0}\)
with \(N(0)=0\) and for any \(a,b\in R\) with \(b\neq0\) there exists
elements \(q,r\in R\) such that \(a=qb+r\) and \(r=0\) or \(N(r)\lt N(b)\)
(<a href="https://mizar.uwb.edu.pl/version/current/html/int_3.html#V1"><code>int_3:def 8</code></a>)
</p>

<p>
The function \(N\) is called the <dfn>Degree Function</dfn> in Mizar
(<a href="https://mizar.uwb.edu.pl/version/current/html/int_3.html#M1"><code>int_3:def 9</code></a>).
</p></li>
<li><b>Proposition 1.</b> Every ideal in a Euclidean domain is principal;
i.e., if \(I\) is any nonzero ideal in the Euclidean domain \(R\), then
there exists a \(d\in R\) such that \(I=(d)\).
(<a href="https://mizar.uwb.edu.pl/version/current/html/ideal_1.html#T94"><code>ideal_1:94</code></a>)</li>
<li><b>Definition.</b> Let \(R\) be a commutative ring, let \(a,b\in R\) with \(b\neq0\).
<ol class="org-ol">
<li>We say \(a\) is a <dfn>multiple</dfn> of \(b\) if there exists an
element \(x\in R\) with \(a=bx\). In this case, we also say \(b\)
<dfn>Divides</dfn> \(a\)
(<a href="https://mizar.uwb.edu.pl/version/current/html/gcd_1.html#R1"><code>gcd_1:def 1</code></a>)</li>
<li>A <dfn>Greatest Common Divisor</dfn> of \(a\) and \(b\) is a nonzero
element \(d\) such that \(d\) divides \(a\), and \(d\) divides \(b\), and
for any other \(d'\in R\) if \(d'\) divides both \(a\) and \(b\) then
\(d'\) divides \(d\).
(This is generalized in <a href="https://mizar.uwb.edu.pl/version/current/html/gcd_1.html#K5"><code>gcd_1:def 12</code></a> and especially <a href="https://mizar.uwb.edu.pl/version/current/html/ring_4.html#V4"><code>ring_4:def 10</code></a>)</li>
</ol></li>
<li><b>Proposition 2.</b> If \(a\) and \(b\) are elements of a commutative ring
\(R\) such that the ideal generated by \(a\) and \(b\) is a principal
ideal \((d)\), then \(d\) is a greatest common divisor of \(a\) and \(b\)
<span class="missing">Missing from Mizar</span></li>
<li><b>Proposition 3.</b> Let \(R\) be an integral domain. If two elements \(d\)
and \(d'\) of \(R\) generate the same principal ideal \((d)=(d')\), then
\(d'=ud\) for some unit \(u\in R\).
(<a href="https://mizar.uwb.edu.pl/version/current/html/ring_2.html#T21"><code>ring_2:21</code></a>)</li>
<li><b>Theorem 4.</b> Let \(R\) be a Euclidian domain, let \(a\) and \(b\) be
nonzero elements of \(R\). Let \(d=r_{n}\) be the last nonzero remainder
in the Euclidian algorithm. Then
<ol class="org-ol">
<li>\(d\) is a greatest common divisor of \(a\) and \(b\) (<span class="missing">Missing from Mizar</span>), and</li>
<li>The principal ideal \((d)\) is the ideal generated by \(a\) and \(b\)
(<span class="missing">Missing from Mizar</span> but seems to follow from <a href="https://mizar.uwb.edu.pl/version/current/html/ring_2.html#T18"><code>ring_2:18</code></a>)</li>
</ol></li>
<li><b>Proposition 5.</b> Let \(R\) be an integral domain that is not a
field. If \(R\) is a Euclidian domain, then there are universal side
divisors in \(R\).</li>
</ul>
</div>
</div>
<div id="outline-container-h-f4dae11f-3f15-486f-bcd3-d5bd8c5bc045" class="outline-3">
<h3 id="h-f4dae11f-3f15-486f-bcd3-d5bd8c5bc045">&sect;8.2 Principal Ideal Domains</h3>
<div class="outline-text-3" id="text-h-f4dae11f-3f15-486f-bcd3-d5bd8c5bc045">
<ul class="org-ul">
<li><b>Definition.</b> A <dfn>Principal Ideal Domain</dfn> (PID) is an
integral domain in which every ideal is principal (<a href="https://mizar.uwb.edu.pl/version/current/html/ideal_1.html#V8"><code>ideal_1:def 28</code></a>
and <a href="https://mizar.uwb.edu.pl/version/current/html/ring_2.html#NM5"><code>ring_2</code></a>).</li>
<li><b>Proposition 6.</b> Let \(R\) be a principal ideal domain, let \(a\) and
\(b\) be nonzero elements of \(R\). Let \(d\) be a generator for the ideal
generated by \(a\) and \(b\). Then
<ol class="org-ol">
<li>\(d\) is a greatest common divisor of \(a\) and \(b\) <span class="missing">Missing from Mizar</span></li>
<li>\(d\) can be written as an $R$-linear combination of \(a\) and \(b\),
i.e., there exists \(x\) and \(y\) in \(R\) with \(d=ax+by\) <span class="missing">Missing from Mizar</span></li>
<li>\(d\) is unique up to multiplication by a unit of \(R\) <span class="missing">Missing from Mizar</span></li>
</ol></li>
<li><b>Proposition 7.</b> Every nonzero prime ideal in a principal ideal
domain is a maximal ideal.
(<a href="https://mizar.uwb.edu.pl/version/current/html/ring_2.html#T26"><code>ring_2:26</code></a>)</li>
<li><b>Corollary 8.</b> If \(R\) is any commutative ring such that the
polynomial ring \(R[x]\) is a principal ideal domain (or a Euclidian
domain), then \(R\) is necessarily a field. <span class="missing">Missing from Mizar</span></li>
<li><b>Definition.</b> Define \(N\) to be a <dfn>Dedekind-Hasse norm</dfn> if
\(N\) is a positive norm and for every nonzero \(a,b\in R\) either \(a\)
is an element of the ideal \((b)\) or there is a nonzero element in
the ideal \((a,b)\) of norm strictly less than the norm of \((b)\)
(i.e., either \(b\) divides \(a\) in \(R\), or there exists \(s,t\in R\)
with \(0\lt N(sa-tb)\lt N(b)\)) <span class="missing">Missing from Mizar</span></li>
<li><b>Proposition 9.</b> The integral domain \(R\) is a PID if and only if \(R\)
has a Dedekind-Hasse norm. <span class="missing">Missing from Mizar</span></li>
</ul>
</div>
</div>
<div id="outline-container-h-2158426a-1061-4e09-be8d-2ae8fe5a9c85" class="outline-3">
<h3 id="h-2158426a-1061-4e09-be8d-2ae8fe5a9c85">&sect;8.3 Unique Factorization Domains</h3>
<div class="outline-text-3" id="text-h-2158426a-1061-4e09-be8d-2ae8fe5a9c85">
<ul class="org-ul">
<li><b>Definition.</b> Let \(R\) be an integral domain
<ul class="org-ul">
<li>Suppose \(r\in R\) is nonzero and is not a unit. Then \(r\) is called
<dfn>Irreducible</dfn> if whenever \(r=ab\) with \(a,b\in R\), then 
either \(a\) is a unit in \(R\) or \(b\) is a unit in \(R\) or both;
otherwise \(r\) is called <dfn>Reducible</dfn>
(<a href="https://mizar.uwb.edu.pl/version/current/html/ring_2.html#V5"><code>ring_2:def 9</code></a>)</li>
<li>The nonzero element \(p\in R\) is called <dfn>Prime</dfn> in \(R\) if
the ideal \((p)\) generated by \(p\) is a prime ideal. In other words,
a nonzero element \(p\) is prime if it is not a unit and whenever
\(p\mid ab\) either \(p\mid a\) or \(p\mid b\)
(<a href="https://mizar.uwb.edu.pl/version/current/html/ring_2.html#V4"><code>ring_2:def 8</code></a>)</li>
<li>Two elements \(a,b\in R\) differing by a unit are said to be
<dfn>Associated</dfn> if \(a=ub\) for some unit \(u\in R\)
(<a href="https://mizar.uwb.edu.pl/version/current/html/gcd_1.html#R3"><code>gcd_1:def 3</code></a>)</li>
</ul></li>
<li><b>Proposition 10.</b> In an integral domain a prime element is always
irreducible. (Registered in <a href="https://mizar.uwb.edu.pl/version/current/html/ring_2.html#CC7"><code>ring_2</code></a>)</li>
<li><b>Proposition 11.</b> In a PID, a nonzero element is prime iff it is
irreducible (<a href="https://mizar.uwb.edu.pl/version/current/html/ring_2.html#T26"><code>ring_2:26</code></a>)</li>
<li><b>Definition.</b> A <dfn>Unique Factorization Domain</dfn> (UFD, <a href="https://mizar.uwb.edu.pl/version/current/html/ring_2.html#V8"><code>ring_2:def 15</code></a>) is an
integral domain \(R\) in which every nonzero element \(r\in R\) which is
not a unit has the following two properties
<ol class="org-ol">
<li>\(r\) can be written as a finite product of irreducibles \(p_{i}\) of
\(R\), i.e., \(r=p_{1}p_{2}\dots p_{n}\); and</li>
<li>the decomposition in (1) is unique up to associates</li>
</ol></li>
<li><b>Proposition 12.</b> In a UFD, a nonzero element is prime iff it is
irreducible.</li>
<li><b>Theorem 14.</b> Every principal ideal domain is a unique factorization
domain. (This is a registered fact in <a href="https://mizar.uwb.edu.pl/version/current/html/ring_2.html#CC18"><code>ring_2</code></a>)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-h-a1d9ea93-b470-4d40-b8f8-f1b6a318547b" class="outline-2">
<h2 id="h-a1d9ea93-b470-4d40-b8f8-f1b6a318547b">Ch. 9 Polynomial Rings</h2>
<div class="outline-text-2" id="text-h-a1d9ea93-b470-4d40-b8f8-f1b6a318547b">
</div>
