comp-sci/theorem-provers/mizar/rings.org
** \sect9.1 Definitions and Basic Properties
:PROPERTIES:
:CUSTOM_ID: h-1aad5b7b-2c3b-4d78-92f1-5ceea8559a31
:END:

- *Implicit definition.* The {{{dfn(Degree)}}} of a polynomial
  $p(x)=a_{n}x^{n}+\dots+a_{1}x+a_{0}$ where $a_{n}\neq0$ is
  $\deg(p)=n$
  ([[https://mizar.uwb.edu.pl/version/current/html/hurwitz.html#K2][~hurwitz:def 2~]])
- *Proposition 1.* Let $R$ be an integral domain
  1. $\deg(p(x)q(x))=\deg(p(x))+\deg(q(x))$
     ([[https://mizar.uwb.edu.pl/version/current/html/hurwitz.html#T23][~hurwitz:23~]])
  2. the units of $R[x]$ is just the units of $R$ {{{missing()}}}
  3. $R[x]$ is an integral domain {{{missing()}}}
- *Proposition 2.* Let $I$ be an ideal of the ring $R$, let $(I)=I[x]$
  denote the ideal of $R[x]$ generated by $I$ (the set of polynomials
  with coefficients in $I$). Then $R[x]/(I)\cong(R/I)[x]$. In
  particular, if $I$ is a prime ideal of $R$ then $(I)$ is a prime
  ideal of $R[x]$. {{{missing()}}}
- *Definition.* The {{{dfn(Polynomial Ring in the variables $x_{1}$,
  ..., $x_{n}$ with coefficients in $R$)}}} denoted $R[x_{1},\dots,x_{n}]$ 
  is defined inductively by $R[x_{1},\dots,x_{n-1},x_{n}]=R[x_{1},\dots,x_{n-1}][x_{n}]$
  - Although this is easier for informal mathematics, Mizar formalizes
    a notion of "bags" to describe monomials as a function from the
    set of unknowns to the exponent for each unknown. A polynomial is
    then a formal $R$-linear combination of bags.

** \sect9.2 Polynomial Rings over Fields (Part 1)
:PROPERTIES:
:CUSTOM_ID: h-5f3eb5d1-c6e9-47a0-afaa-3d09dab813ae
:END:

- *Theorem 3.* Let $F$ be a field. The polynmial ring $F[x]$ is a
  Euclidian domain. Specifically, if $a(x)$ and $b(x)$ are two
  polynomials in $F[x]$ with $b(x)$ nonzero, then there are /unique/
  $q(x)$ and $r(x)$ in $F[x]$ such that $a(x)=q(x)b(x)+r(x)$ with
  $r(x)=0$ or $\deg(r(x))\lt\deg(b(x))$. {{{missing()}}}
- *Corollary 4.* If $F$ is a field, then $F[x]$ is a PID and a UFD.
  {{{missing()}}}

** \sect9.3 Polynomial Rings that are Unique Factorization Domains
:PROPERTIES:
:CUSTOM_ID: h-73e98f0b-deec-4f26-8ae6-9386f58f9f2b
:END:

- *Proposition 5* (Gauss's Lemma). Let $R$ be a UFD with field of
  fractions $F$ and let $p(x)\in R[x]$. If $p(x)$ is reducible in
  $F[x]$ then $p(x)$ is reducible in $R[x]$. More precisely, if
  $p(x)=A(x)B(x)$ for some nonconstant polynomials $A(x),B(x)\in F[x]$,
  then there are nonzero elements $r,s\in F$ such that $rA(x)=a(x)$
  and $sB(x)=b(x)$ both lie in $R[x]$ and $p(x)=a(x)b(x)$ is a
  factorization in $R[x]$. {{{missing()}}}
- *Corollary 6.* Let $R$ be a UFD, let $F$ be its field of fractions,
  and let $p(x)\in R[x]$. Suppose the greatest common divisor of the
  coefficients of $p(x)$ is 1. Then $p(x)$ is irreducible in $R[x]$ if
  and only if it is irreducible in $F[x]$. In particular, if $p(x)$ is
  a monic polynomial that is irreducible in $R[x]$, then $p(x)$ is
  irreducible in $F[x]$. {{{missing()}}}
- *Theorem 7.* $R$ is a UFD if and only if $R[x]$ is a UFD {{{missing()}}}
- *Corollary 8.* If $R$ is a UFD, then a polynomial ring in an
  arbitrary number of variables with coefficients in $R$ is also a UFD. {{{missing()}}}

** \sect9.4 Irreducibility Criteria
:PROPERTIES:
:CUSTOM_ID: h-fca83440-61f5-4a5d-936b-4d2e21b3d42d
:END:

- *Proposition 9.* Let $F$ be a field, let $p(x)\in F[x]$. Then $p(x)$
  has a factor of degree one if and only if $p(x)$ has a root in $F$,
  i.e., there is an $\alpha\in F$ with $p(\alpha)=0$ {{{missing()}}}
- *Proposition 10.* A polynomial of degree 2 or 3 over a field $F$ is
  reducible if and only if it has a root in $F$
  ([[https://mizar.uwb.edu.pl/version/current/html/field_10.html#T5][~field_10:5~]] and [[https://mizar.uwb.edu.pl/version/current/html/field_10.html#T6][~field_10:6~]])
- *Proposition 12.* Let $I$ be a proper ideal in the integral domain
  $R$ and let $p(x)$ be a nonconstant monic polynomial in $R[x]$. If
  the image of $p(x)$ in $(R/I)[x]$ cannot be factored in $(R/I)[x]$
  into two polynomials of smaller degree, then $p(x)$ is irreducible
  in $R[x]$. {{{missing()}}}
- *Proposition 13* (Eisenstein's criterion). Let $P$ be a prime ideal
  of the integral domain $R$ and let $f(x)=x^{n}+a_{n-1}x^{n-1}+\dots+a_{1}x+a_{0}$
  be a polynomial in $R[x]$ (where $n\geq1$). Suppose $a_{n-1}$, ...,
  $a_{1}$, $a_{0}$ are elements of $P$ and suppose $a_{0}\notin
  P^{2}$. Then $f(x)$ is irreducible in $R[x]$. {{{missing()}}}